app/controllers/applications_controller.rb

SELECT "applications".* FROM "applications"
SELECT COUNT(*) FROM "applications"
---
  def index
    @applications = Application.all
    @sumSolicitudes = Application.all.count

SELECT  "applications".* FROM "applications"  WHERE "applications"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "equipment" SET "solicitadoss" = 'f'
UPDATE "instruments" SET "solicitados" = 'f'
UPDATE "tools" SET "solicitados" = 'f'
UPDATE "consumables" SET "solicitados" = 'f'
UPDATE "chemical_substances" SET "solicitados" = 'f'
---
  def show
    @application = Application.find(params[:id])
    @equipos = Equipment.where(:solicitados => true)
    @instruments = Instrument.where(:solicitados => true)
    @tools = Tool.where(:solicitados => true)
    @consumables = Consumable.where(:solicitados => true)
    @sustancias = ChemicalSubstance.where(:solicitados => true)

    respond_to do |format|
      format.html
      format.pdf do
        pdf = SolicitudServicio.new(@application)
        send_data pdf.render, filename: 'SolicitudServicio.pdf', type: 'application/pdf'
      end
    end
    @equipment = Equipment.update_all(:solicitados => false)
    @instrumentos = Instrument.update_all(:solicitados => false)
    @herramientas = Tool.update_all(:solicitados => false)
    @consumibles = Consumable.update_all(:solicitados => false)
    @sustanciasqui = ChemicalSubstance.update_all(:solicitados => false)

SELECT "equipment".* FROM "equipment"  WHERE "equipment"."solicitados" = 't'  ORDER BY created_at DESC
SELECT "instruments".* FROM "instruments"  WHERE "instruments"."solicitados" = 't'  ORDER BY created_at DESC
SELECT "tools".* FROM "tools"  WHERE "tools"."solicitados" = 't'  ORDER BY created_at DESC
SELECT "consumables".* FROM "consumables"  WHERE "consumables"."solicitados" = 't'  ORDER BY created_at DESC
SELECT "chemical_substances".* FROM "chemical_substances"  WHERE "chemical_substances"."id2" IS NULL
---
  def new
    binding.pry
    @lista
    @application = Application.new
    @equipment = Equipment.where(:solicitados => true).all.order('created_at DESC')
    @instruments = Instrument.where(:solicitados => true).all.order('created_at DESC')
    @tools = Tool.where(:solicitados => true).all.order('created_at DESC')
    @consumables = Consumable.where(:solicitados => true).all.order('created_at DESC')
    @sustancias = ChemicalSubstance.where(id2: params[:item_ids])

INSERT INTO "applications" ("created_at", "descripcion", "fechaRequerida", "updated_at", "uso") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-01-23 11:24:11.713967"], ["descripcion", "a"], ["fechaRequerida", "24-01-2015"], ["updated_at", "2015-01-23 11:24:11.713967"], ["uso", "DOCENTE"]]
---
  def create
    @application = Application.new(application_params)

    respond_to do |format|
      if @application.save

DELETE FROM "applications" WHERE "applications"."id" = $1  [["id", 1]]
---
  def destroy
    @application.destroy

SELECT  "applications".* FROM "applications"  WHERE "applications"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_application
      @application = Application.find(params[:id])