app/controllers/binnacles_controller.rb

SELECT "binnacles".* FROM "binnacles"  WHERE "binnacles"."idSustancia" = 'SQ-1'
---
  def index
    if params[:format]
      @binnacles = Binnacle.where(idSustancia: params[:format])

INSERT INTO "binnacles" ("consumo", "created_at", "fecha", "idSustancia", "ingreso", "saldo", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["consumo", 2], ["created_at", "2015-02-19 03:18:04.394691"], ["fecha", "2015-02-18"], ["idSustancia", "SQ-1"], ["ingreso", 1], ["saldo", 3], ["updated_at", "2015-02-19 03:18:04.394691"]]
---
  def create
    @binnacle = Binnacle.new(binnacle_params)
    flash[:notice] = 'Se ha añadido un registro a la bitácora exitosamente.' if @binnacle.save

UPDATE "binnacles" SET "fecha" = $1, "idSustancia" = $2, "updated_at" = $3 WHERE "binnacles"."id" = 6  [["fecha", "2015-02-18"], ["idSustancia", ""], ["updated_at", "2015-02-19 03:09:24.607940"]]
---
  def update
    flash[:notice] = 'La bitácora se ha actualizado exitosamente.' if @binnacle.update(binnacle_params)

SELECT  "binnacles".* FROM "binnacles"  WHERE "binnacles"."id" = $1 LIMIT 1  [["id", 7]]
---
    def set_binnacle
      @binnacle = Binnacle.find(params[:id])