app/controllers/budget_controller.rb

  def summary
    @labs = Lab.all
    @incomes = Income.all
    @commitments = Commitment.all

    @executions = Execution.all

    @incomes_lab = []
    @commitments_lab = []

    @executions_commitement = []

    @incomes_total = 0
    @commitments_total = 0

    @executions_total = 0


    @labs.each do |l|
      @incomes_lab[l.id] = @incomes.where(lab_id: l.id).sum(:amount)
      @incomes_total += @incomes_lab[l.id]
      @commitments_lab[l.id] = @commitments.where(lab_id: l.id).sum(:amount)
      @commitments_total += @commitments_lab[l.id]
      @executions_commitement[l.id] = @executions.where(commitment_id: l.id).where("check_annulled=false").sum(:check_amount)
---
SELECT "labs".* FROM "labs"
SELECT SUM("incomes"."amount") AS sum_id FROM "incomes"  WHERE "incomes"."lab_id" = 1
SELECT SUM("commitments"."amount") AS sum_id FROM "commitments"  WHERE "commitments"."lab_id" = 1
SELECT SUM("executions"."check_amount") AS sum_id FROM "executions"  WHERE "executions"."commitment_id" = 1 AND (check_annulled=false)