app/controllers/chemical_substances_controller.rb

  def index
  	if params[:search]
  		@chemical_substances = ChemicalSubstance.where(:showable => true).search(params[:search])
   		@chemical_substances_all=ChemicalSubstance.search(params[:search],params[:column])
  	else
  		@chemical_substances = ChemicalSubstance.where(:showable => true).order('created_at DESC')
   		@chemical_substances_all=ChemicalSubstance.all.order('created_at DESC')
  	end
    @sum = ChemicalSubstance.count
---
SELECT "chemical_substances".* FROM "chemical_substances"  WHERE "chemical_substances"."showable" = 't'  ORDER BY created_at DESC
SELECT "chemical_substances".* FROM "chemical_substances"   ORDER BY created_at DESC
SELECT COUNT(*) FROM "chemical_substances"

  def create
    @chemical_substance = ChemicalSubstance.new(chemical_substance_params)
    @sum = ChemicalSubstance.count

    respond_to do |format|
      if @chemical_substance.save
---
SELECT COUNT(*) FROM "chemical_substances"
INSERT INTO "chemical_substances" ("adquisition_date", "bill", "buy_order", "cas", "controlled", "corrosive", "cost", "created_at", "dependency", "expiration_date", "explosive", "extention", "id2", "inflamable", "investigation", "irritating", "location", "matter_states", "meassure", "name", "nocive", "oxidant", "purity", "quantity", "rI4", "rI7", "responsible", "status", "teaching", "toxic", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31) RETURNING "id"

  def destroy
    @chemical_substance.destroy
---
DELETE FROM "chemical_substances" WHERE "chemical_substances"."id" = $1  [["id", 1]]

    def set_chemical_substance
      @chemical_substance = ChemicalSubstance.find(params[:id])
---
SELECT  "chemical_substances".* FROM "chemical_substances"  WHERE "chemical_substances"."id" = $1 LIMIT 1  [["id", 17]]