app/controllers/commitments_controller.rb

  def index
    @commitments = Commitment.all.order("date ASC")
    @sum = @commitments.sum(:amount)
---
SELECT "commitments".* FROM "commitments"   ORDER BY date ASC
SELECT SUM("commitments"."amount") AS sum_id FROM "commitments"

  def show
    @commitment = Commitment.find(params[:id])
    @executions = Execution.where("commitment_id=?",params[:id]).where("valid_adm=? AND valid_dir=?", true, true)
    @sum = @executions.where("check_annulled=false").sum(:check_amount)
    @dif = @commitment.amount - @sum
    @size = @executions.count
---
SELECT  "commitments".* FROM "commitments"  WHERE "commitments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT SUM("executions"."check_amount") AS sum_id FROM "executions"  WHERE (commitment_id='1') AND (check_annulled=false)
SELECT COUNT(*) FROM "executions"  WHERE (commitment_id='2')

  def new
    @commitment = Commitment.new
    @labs = Lab.all
---
SELECT "labs".* FROM "labs"

  def create
    # Check Date
    unless params[:commitment].nil?
      begin
        params[:commitment][:date] = Date.parse(params[:commitment][:date])
      rescue ArgumentError
        params[:commitment][:date] = nil
      end
    end

    @commitment = Commitment.new(commitment_params)

    if @commitment.save
      redirect_to action: 'index'
    else
      @labs = Lab.all
---
INSERT INTO "commitments" ("amount", "code", "created_at", "date", "description", "lab_id", "observations", "recipient", "sae_code", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "labs".* FROM "labs"

  def edit
    @commitment = Commitment.find(params[:id])
    @labs = Lab.all
---
SELECT  "commitments".* FROM "commitments"  WHERE "commitments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "labs".* FROM "labs"