app/controllers/consumables_controller.rb

  def index
  	if params[:search]
  		@consumables = Consumable.where(:showable => true).search(params[:search])
  		@consumables_all = Consumable.search(params[:search])
  	else
  		@consumables = Consumable.where(:showable => true).all.order('created_at DESC')
  		@consumables_all = Consumable.all.order('created_at DESC')
  	end
    @sum = Consumable.count
---
SELECT "consumables".* FROM "consumables"  WHERE "consumables"."showable" = 't'  ORDER BY created_at DESC
SELECT COUNT(*) FROM "consumables"

  def create
    @consumable = Consumable.new(consumable_params)

    respond_to do |format|
      if @consumable.save
---
INSERT INTO "consumables" ("adquisition_date", "bill", "buy_order", "cost", "created_at", "dependency", "description", "extention", "id2", "investigation", "location", "management", "material", "name", "quantity", "responsible", "teaching", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"

  def destroy
    @consumable.destroy
---
DELETE FROM "consumables" WHERE "consumables"."id" = $1  [["id", 2]]

    def set_consumable
      @consumable = Consumable.find(params[:id])
---
SELECT  "consumables".* FROM "consumables"  WHERE "consumables"."id" = $1 LIMIT 1  [["id", 2]]