app/controllers/equipment_controller.rb

SELECT "equipment".* FROM "equipment"   ORDER BY created_at DESC
SELECT COUNT(*) FROM "equipment"
---
  def index
    @equipments = Equipment.all
  if params[:search]
    @equipments = Equipment.search(params[:search])
  else
    @equipments = Equipment.all.order('created_at DESC')
  end
  @sum = Equipment.count

INSERT INTO "equipment" ("adquisition_date", "bill", "brand", "buy_order", "calibrated", "cost", "created_at", "dependency", "depth", "extention", "investigation", "last_calibration", "length", "location", "management", "measuredepth", "measurelength", "measurewidth", "model", "name", "national_good", "responsible", "serial", "status", "teaching", "updated_at", "width") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27) RETURNING "id"
---
  def create
    @equipment = Equipment.new(equipment_params)

    respond_to do |format|
      if @equipment.save

DELETE FROM "equipment" WHERE "equipment"."id" = $1  [["id", 2]]
---
  def destroy
    @equipment.destroy

SELECT  "equipment".* FROM "equipment"  WHERE "equipment"."id" = $1 LIMIT 1  [["id", 27]]
---
    def set_equipment
      @equipment = Equipment.find(params[:id])