app/controllers/equipment_controller.rb

  def index
  	if params[:search]
  		@equipment_all = Equipment.search(params[:search])
  		@equipment = Equipment.where(:showable => true).search(params[:search])
---
SELECT "equipment".* FROM "equipment"  WHERE "equipment"."showable" = 't'  ORDER BY created_at DESC