app/controllers/executions_controller.rb

  def index
    @executions = Execution.all
    @sum = @executions.where("check_annulled=false").sum(:check_amount)
---
SELECT "executions".* FROM "executions"
SELECT SUM("executions"."check_amount") AS sum_id FROM "executions"  WHERE (check_annulled=false)

  def show
    @execution = Execution.find(params[:id])
    @executions = Execution.where("commitment_id=?",params[:cid])
    @sum = @executions.where("check_annulled=false").sum(:check_amount)
---
SELECT  "executions".* FROM "executions"  WHERE "executions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT SUM("executions"."check_amount") AS sum_id FROM "executions"  WHERE (commitment_id=NULL) AND (check_annulled=false)

  def list
    @execution = Execution.find(params[:cid])
    @executions = Execution.where("commitment_id=?",params[:cid])
    @sum = @executions.where("check_annulled=false").sum(:check_amount)

    @commitments = Commitment.find(params[:cid])
---
SELECT  "executions".* FROM "executions"  WHERE "executions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT SUM("executions"."check_amount") AS sum_id FROM "executions"  WHERE (commitment_id='1') AND (check_annulled=false)
SELECT  "commitments".* FROM "commitments"  WHERE "commitments"."id" = $1 LIMIT 1  [["id", 1]]

  def new
    @execution = Execution.new
    if params[:cid]
      @commitment = Commitment.find(params[:cid])
---
SELECT  "commitments".* FROM "commitments"  WHERE "commitments"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    # Check Date
    unless params[:execution].nil?
      begin
        params[:execution][:check_elaboration_date] = Date.parse(params[:execution][:check_elaboration_date])
      rescue ArgumentError
        params[:execution][:check_elaboration_date] = nil
      end
    end

    @execution = Execution.new(execution_params)

    @commitment = Commitment.find(params[:cid])
    @executions = Execution.where("commitment_id=?",params[:cid])
    @executed = @executions.where("check_annulled=false").sum(:check_amount)
    if !@execution.check_amount.blank?
      if @execution.check_amount > @commitment.amount - @executed
        @execution.executable_amount
        render 'new'
      else
        if @execution.save
---
SELECT  "commitments".* FROM "commitments"  WHERE "commitments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT SUM("executions"."check_amount") AS sum_id FROM "executions"  WHERE (commitment_id='1') AND (check_annulled=false)
INSERT INTO "executions" ("check_amount", "check_elaboration_date", "check_number", "code", "commitment_id", "created_at", "document_name", "remarks", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    @execution = Execution.find(params[:id])
    @commitment = Commitment.find(Execution.find(params[:id]).commitment_id)
---
SELECT  "executions".* FROM "executions"  WHERE "executions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "commitments".* FROM "commitments"  WHERE "commitments"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    # Check Date
    unless params[:execution].nil?
      if !params[:execution][:check_elaboration_date].nil?
        begin
          params[:execution][:check_elaboration_date] = Date.parse(params[:execution][:check_elaboration_date])
        rescue ArgumentError
          params[:execution][:check_elaboration_date] = nil
        end
      end
    end

    @execution = Execution.find(params[:id])
    @commitment = Commitment.find(Execution.find(params[:id]).commitment_id)

    @oldamount = @execution.check_amount
    @executions = Execution.where("commitment_id=?",@execution.commitment_id)
    @executed = @executions.where("check_annulled=false").sum(:check_amount) - @oldamount

    if params[:execution][:check_amount].to_i > @commitment.amount - @executed
      @execution.executable_amount
      render 'edit'
    else
      if @execution.update_attributes(execution_params)
---
SELECT  "executions".* FROM "executions"  WHERE "executions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "commitments".* FROM "commitments"  WHERE "commitments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT SUM("executions"."check_amount") AS sum_id FROM "executions"  WHERE (commitment_id=1) AND (check_annulled=false)
UPDATE "executions" SET "check_delivery_date" = $1, "check_number" = $2, "remarks" = $3, "updated_at" = $4 WHERE "executions"."id" = 1  [["check_delivery_date", "2015-02-28"], ["check_number", "12345678"], ["remarks", ""], ["updated_at", "2015-02-17 22:33:59.915228"]]