app/controllers/incomes_controller.rb

  def index
    @incomes = Income.all.order("date ASC")
    @sum = @incomes.sum(:amount)
---
SELECT "incomes".* FROM "incomes"   ORDER BY date ASC
SELECT SUM("incomes"."amount") AS sum_id FROM "incomes"

  def show
    @income = Income.find(params[:id])
---
SELECT  "incomes".* FROM "incomes"  WHERE "incomes"."id" = $1 LIMIT 1  [["id", 1]]

  def new
    @income = Income.new
    @labs = Lab.all
---
SELECT "labs".* FROM "labs"

  def create
    # Check Date
    unless params[:income].nil?
      begin
        params[:income][:date] = Date.parse(params[:income][:date])
      rescue ArgumentError
        params[:income][:date] = nil
      end
    end

    if params[:income][:resource] == ""
    	params[:income][:resource] = 0
    end

    @income = Income.new(income_params)

    if @income.save
#      redirect_to action: 'index'
		redirect_to incomes_path, notice: "The document has been uploaded."

    else
      @labs = Lab.all
---
INSERT INTO "incomes" ("amount", "created_at", "date", "description", "doc_code", "doc_date", "document", "lab_id", "organism", "origin", "resource_description", "sae_code", "unit", "updated_at", "variation") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
SELECT "labs".* FROM "labs"

  def edit
    @income = Income.find(params[:id])
    @labs = Lab.all
---
SELECT  "incomes".* FROM "incomes"  WHERE "incomes"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "labs".* FROM "labs"

  def update
    # Check Date
    unless params[:income].nil?
      begin
        params[:income][:date] = Date.parse(params[:income][:date])
      rescue ArgumentError
        params[:income][:date] = nil
      end
    end

    if params[:income][:resource] == ""
    	params[:income][:resource] = 0
    end

    @income = Income.find(params[:id])

    if @income.update_attributes(income_params)
      redirect_to income_url(@income)
    else
      @labs = Lab.all
---
SELECT  "incomes".* FROM "incomes"  WHERE "incomes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "incomes" SET "doc_code" = $1, "document" = $2, "updated_at" = $3 WHERE "incomes"."id" = 3  [["doc_code", "123456111"], ["document", "40ab2b6037aa9d571a91be10f3084be9.pdf"], ["updated_at", "2015-02-19 05:39:40.811983"]]
SELECT "labs".* FROM "labs"