app/controllers/instruments_controller.rb

  def index
    @instruments = Instrument.all
	if params[:search]
		@instruments = Instrument.where(:showable => true).search(params[:search])
		@instruments_all = Instrument.search(params[:search])
	else
		@instruments = Instrument.where(:showable => true).all.order('created_at DESC')
		@instruments_all = Instrument.all.order('created_at DESC')
	end
  @sum = Instrument.count
---
SELECT "instruments".* FROM "instruments"   ORDER BY created_at DESC
SELECT "instruments".* FROM "instruments"  WHERE "instruments"."showable" = 't'  ORDER BY created_at DESC
SELECT COUNT(*) FROM "instruments"

  def create
    @instrument = Instrument.new(instrument_params)

    respond_to do |format|
      if @instrument.save
---
INSERT INTO "instruments" ("adquisition_date", "bill", "brand", "buy_order", "capacity", "cost", "created_at", "dependency", "extention", "investigation", "last_calibration", "location", "management", "material", "measurement_unit", "name", "national_good", "responsible", "status", "teaching", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"

  def destroy
    @instrument.destroy
---
DELETE FROM "instruments" WHERE "instruments"."id" = $1  [["id", 1]]

    def set_instrument
      @instrument = Instrument.find(params[:id])
---
SELECT  "instruments".* FROM "instruments"  WHERE "instruments"."id" = $1 LIMIT 1  [["id", 1]]