app/controllers/loans_controller.rb

  def index
    @loans = Loan.all
    @sumSolicitudes = Loan.all.count
---
SELECT "loans".* FROM "loans"
SELECT COUNT(*) FROM "loans"

  def show
    @loan = Loan.find(params[:id])
---
SELECT  "loans".* FROM "loans"  WHERE "loans"."id" = $1 LIMIT 1  [["id", 1]]

  def new
    binding.pry
    if params[:item_ids] == nil
      flash[:notice] = "No ha seleccionado ningun item para ser prestado"
      redirect_to :back
    else
      @loan = Loan.new
      @equipment = Equipment.where(id2: params[:item_ids])
      @instruments = Instrument.where(id2: params[:item_ids])
      @tools = Tool.where(id2: params[:item_ids])
      @consumables = Consumable.where(id2: params[:item_ids])
      @sustancias = ChemicalSubstance.where(id2: params[:item_ids])
---
SELECT "equipment".* FROM "equipment"  WHERE "equipment"."id2" IN ('on')
SELECT "instruments".* FROM "instruments"  WHERE "instruments"."id2" IN ('on')
SELECT "tools".* FROM "tools"  WHERE "tools"."id2" IN ('on')
SELECT "consumables".* FROM "consumables"  WHERE "consumables"."id2" IN ('on')
SELECT "chemical_substances".* FROM "chemical_substances"  WHERE "chemical_substances"."id2" IN ('on')

  def create
    @loan = Loan.new(loan_params)

    respond_to do |format|
      if @loan.save
---
INSERT INTO "loans" ("condiciones", "created_at", "fechaEntrega", "fechaTope", "medida", "ubicacion", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @loan.destroy
---
DELETE FROM "loans" WHERE "loans"."id" = $1  [["id", 1]]

    def set_loan
      @loan = Loan.find(params[:id])
---
SELECT  "loans".* FROM "loans"  WHERE "loans"."id" = $1 LIMIT 1  [["id", 1]]