app/controllers/projects_controller.rb

def list
  @projects = Project.all.order("project_number ASC")
  @sum = @projects.where("NOT(status=3) AND NOT(status=4)").sum(:amount)
---
SELECT "projects".* FROM "projects"   ORDER BY project_number ASC
SELECT SUM("projects"."amount") AS sum_id FROM "projects"  WHERE (NOT(status=3) AND NOT(status=4))