app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"   ORDER BY project_number ASC
SELECT SUM("projects"."amount") AS sum_id FROM "projects"  WHERE (NOT(status=3) AND NOT(status=4))
---
  def index
    @projects = Project.all.order("project_number ASC")
    @sum = @projects.where("NOT(status=3) AND NOT(status=4)").sum(:amount)

INSERT INTO "projects" ("amount", "banco", "contract", "created_at", "hhrr", "num_cuenta", "observation", "other_desc", "project_number", "responsible", "sae_code", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    # Check Date
    unless params[:project].nil?
      begin
        params[:project][:incoming_date] = Date.parse(params[:project][:incoming_date])
      rescue ArgumentError
        params[:project][:incoming_date] = nil
      end
    end

    # Default status depending on incoming_date
    if params[:project][:incoming_date].nil?
      params[:project][:status] = 0
    else
      params[:project][:status] = 1
    end

    @project = Project.new(project_params)
    if @project.save

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 6]]
---
    def update

      # Check Date
      unless params[:project].nil?
        begin
          params[:project][:incoming_date] = Date.parse(params[:project][:incoming_date])
          params[:project][:equipments] = (params[:project][:equipments]).to_f
          params[:project][:services] = (params[:project][:services]).to_f
          params[:project][:infrastructure] = (params[:project][:infrastructure]).to_f
          params[:project][:hhrr] = (params[:project][:hhrr]).to_f
          params[:project][:consumables] = (params[:project][:consumables]).to_f
          params[:project][:furniture] = (params[:project][:furniture]).to_f
          params[:project][:amount] = (params[:project][:amount]).to_f
          params[:project][:other_amount] = (params[:project][:amount]).to_f
        rescue ArgumentError
          params[:project][:incoming_date] = nil
          params[:project][:equipments] = nil
          params[:project][:services] = nil
          params[:project][:infrastructure] = nil
          params[:project][:hhrr] = nil
          params[:project][:consumables] = nil
          params[:project][:furniture] = nil
          params[:project][:amount] = nil
          params[:project][:other_amount] = nil
        end
      end

      @project = Project.find(params[:id])

UPDATE "projects" SET "amount" = $1, "hhrr" = $2, "infrastructure" = $3, "updated_at" = $4 WHERE "projects"."id" = 7  [["amount", "12131454.0"], ["hhrr", "10.0"], ["infrastructure", "10.0"], ["updated_at", "2015-02-19 01:53:42.318035"]]
---
            @project.annulled_date_required
            render 'edit'
          else
            if @project.update_attributes(project_params)