app/controllers/tools_controller.rb

SELECT "tools".* FROM "tools"   ORDER BY created_at DESC
SELECT COUNT(*) FROM "tools"
---
  def index
    @tools = Tool.all
	if params[:search]
		@tools = Tool.search(params[:search])
	else
		@tools = Tool.all.order('created_at DESC')
	end
  @sum = Tool.count

SELECT  "tools".* FROM "tools"  WHERE "tools"."id" = $1 LIMIT 1  [["id", 4]]
---
    def set_tool
      @tool = Tool.find(params[:id])